_static/soap_outputs/6.5.314.4301/create_package_from_json_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <package_spec>
          <expire_seconds>660</expire_seconds>
          <display_name>Custom Tagging - Remove Tags</display_name>
          <name>Custom Tagging - Remove Tags API TEST</name>
          <modification_time>2001-01-01T00:00:00</modification_time>
          <verify_expire_seconds>600</verify_expire_seconds>
          <creation_time>2001-01-01T00:00:00</creation_time>
          <verify_group_id>0</verify_group_id>
          <skip_lock_flag>0</skip_lock_flag>
          <last_update>2015-09-14T13:39:15</last_update>
          <source_id>0</source_id>
          <hidden_flag>0</hidden_flag>
          <command>cmd /c cscript //T:60 remove-tags.vbs "||Custom Tags||"</command>
          <command_timeout>60</command_timeout>
          <deleted_flag>0</deleted_flag>
          <available_time>2015-09-14T13:41:15</available_time>
          <files>
            <file>
              <status>200</status>
              <bytes_total>2170</bytes_total>
              <hash>0f24a753484d6bed4a087a12042ae31e1d965be4d08357382a432977ce42b197</hash>
              <id>43</id>
              <cache_status>Cached</cache_status>
              <name>remove-tags.vbs</name>
              <download_seconds>0</download_seconds>
              <bytes_downloaded>2170</bytes_downloaded>
              <source>https://content.tanium.com/files/published/InitialContent/2015-08-31_16-49-58_6.5.2.0164-ga25a6e1/custom_tagging_-_remove_tags/remove-tags.vbs</source>
              <last_download_progress_time>2015-09-14T13:41:15</last_download_progress_time>
              <download_start_time>2015-09-14T13:41:05</download_start_time>
              <size>2170</size>
              <file_status>
                <status>
                  <status>200</status>
                  <bytes_total>2170</bytes_total>
                  <server_id>1</server_id>
                  <last_download_progress_time>2015-09-14T13:41:15</last_download_progress_time>
                  <server_name>TPT1.pytanlab.com:17472</server_name>
                  <download_start_time>2015-09-14T13:41:05</download_start_time>
                  <bytes_downloaded>2170</bytes_downloaded>
                  <cache_status>Cached</cache_status>
                </status>
              </file_status>
            </file>
          </files>
          <verify_group>
            <id>0</id>
          </verify_group>
          <sensors>
            <sensor>
              <id>116</id>
            </sensor>
          </sensors>
          <metadata>
            <item>
              <admin_flag>0</admin_flag>
              <name>defined</name>
              <value>Tanium</value>
            </item>
            <item>
              <admin_flag>0</admin_flag>
              <name>category</name>
              <value>Tanium</value>
            </item>
          </metadata>
        </package_spec>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>